app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @songs = Artist.find_by(params[:artist_id]).songs
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE (abc) LIMIT 1
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "songs".* FROM "songs"